_posts/2013-10-05-welcome-to-jekyll.html
---
layout: post
title:  "Welchhhhhhome to Jekyll!"
date:   2013-10-06 12:04:53
categories: jekyll update
---
<script type="text/javascript">
/*
@licstart  The following is the entire license notice for the
JavaScript code in this tag.

Copyright (C) 2012  Free Software Foundation, Inc.

The JavaScript code in this tag is free software: you can
redistribute it and/or modify it under the terms of the GNU
General Public License (GNU GPL) as published by the Free Software
Foundation, either version 3 of the License, or (at your option)
any later version.  The code is distributed WITHOUT ANY WARRANTY;
without even the implied warranty of MERCHANTABILITY or FITNESS
FOR A PARTICULAR PURPOSE.  See the GNU GPL for more details.

As additional permission under GNU GPL version 3 section 7, you
may distribute non-source (e.g., minimized or compacted) forms of
that code without the copy of the GNU GPL normally required by
section 4, provided you include this license notice and a URL
through which recipients can access the Corresponding Source.


@licend  The above is the entire license notice
for the JavaScript code in this tag.
*/
<!--/*--><![CDATA[/*><!--*/
 function CodeHighlightOn(elem, id)
 {
   var target = document.getElementById(id);
   if(null != target) {
     elem.cacheClassElem = elem.className;
     elem.cacheClassTarget = target.className;
     target.className = "code-highlighted";
     elem.className   = "code-highlighted";
   }
 }
 function CodeHighlightOff(elem, id)
 {
   var target = document.getElementById(id);
   if(elem.cacheClassElem)
     elem.className = elem.cacheClassElem;
   if(elem.cacheClassTarget)
     target.className = elem.cacheClassTarget;
 }
/*]]>*///-->
</script><div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Erstes</a>
<ul>
<li><a href="#sec-1-1">1.1. unter</a></li>
<li><a href="#sec-1-2">1.2. iaia</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. ieansrt</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. ie</a>
<ul>
<li><a href="#sec-2-1">2.1. iant</a></li>
</ul>
</li>
<li><a href="#sec-3">3. iae</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Erstes</h2>
<div class="outline-text-2" id="text-1">
<p>
You'll find this post in your `<sub>posts`</sub> directory - edit this post and re-build (or run with the `-w` switch) to see your changes!
To add new posts, simply add a file in the `<sub>posts`</sub> directory that follows the convention: YYYY-MM-DD-name-of-post.ext.
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> unter</h3>
<div class="outline-text-3" id="text-1-1">
<p>
ientr 
</p>
<ul class="org-ul">
<li>iea
</li>
<li>iea
</li>
<li>ia
</li>
<li>iea
</li>
<li>iean
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> iaia</h3>
<div class="outline-text-3" id="text-1-2">
<p>
ieai
</p>
</div>
<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> ieansrt</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
hint iant
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> ie</h2>
<div class="outline-text-2" id="text-2">
<p>
ioatn
</p>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> iant</h3>
<div class="outline-text-3" id="text-2-1">
<p>
hhh
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> iae</h2>
<div class="outline-text-2" id="text-3">
<p>
Jekyll lso offers powerful support for code snippets:
</p>

<p>
{% highlight ruby %}
def print<sub>hi</sub>(name)
  puts "Hi, #{name}"
end
print<sub>hi</sub>('Tom')
#=&gt; prints 'Hi, Tom' to STDOUT.
{% endhighlight %}
</p>

<p>
bla
</p>


{% highlight ruby %}
def print_hi(name)
  puts "Hi, #{name}"
end
print_hi('Tom')
#=> prints 'Hi, Tom' to STDOUT.
{% endhighlight %}
<p>
ia
iea
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #00bfff;">def</span> <span style="color: #daa520;">print_hi</span>(name)
<span id="coderef-blubber" class="coderef-off">  puts <span style="color: #deb887;">"Hi, </span><span style="color: #4eee94;">#{name}</span><span style="color: #deb887;">"</span> (blubber)</span>
<span style="color: #00bfff;">end</span>
  print_hi(<span style="color: #deb887;">'Tom'</span>)
<span style="color: #7f7f7f;">#</span><span style="color: #7f7f7f;">=&gt; prints 'Hi, Tom' to STDOUT.</span>
</pre>
</div>



<p>
Check <a href="#coderef-blubber"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-blubber');" onmouseout="CodeHighlightOff(this, 'coderef-blubber');">blubber</a> out the [Jekyll docs][jekyll] for more info on how to get the most out of Jekyll. <a href="#coderef-blubber"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-blubber');" onmouseout="CodeHighlightOff(this, 'coderef-blubber');">File</a> all bugs/feature requests at [Jekyll's GitHub repo][jekyll-gh].
</p>

<p>
[jekyll-gh]: <a href="https://github.com/mojombo/jekyll">https://github.com/mojombo/jekyll</a>
[jekyll]:    <a href="http://jekyllrb.com">http://jekyllrb.com</a>
</p>
</div>
</div>
